# TagHeadPosition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndependentTag..::..TagHeadPosition Property
IndependentTag Class See Also
---
The position of the head of tag in model coordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ TagHeadPosition { get; set; }
```

Visual Basic
---
```text
Public Property TagHeadPosition As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ TagHeadPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
The depth of the tag head position in the view does not matter because tags are drawn over model geometry in the view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace